{
  "name": "Moses",
  "gender": "male",
  "origin": "Hebrew",
  "meaning": "Drawn out of water",
  "culturalSignificance": "Moses is one of the most significant figures in the Hebrew Bible and the Quran. As the leader who led the Israelites out of slavery in Egypt and received the Ten Commandments from God on Mount Sinai, Moses is revered in Judaism, Christianity, and Islam. His story of faith, leadership, and divine calling has inspired countless generations throughout history.",
  "modernContext": "The name Moses remains popular among religious families and those seeking a name with deep historical and spiritual significance. While less common than during biblical times, it has seen renewed interest in the 21st century, particularly in the United States and Israel.",
  "literaryReferences": "Moses appears in numerous religious texts, literary works, and artistic representations, symbolizing liberation and divine guidance.",
  "pronunciationGuide": "/ˈmoʊzɪz/",
  "variations": [
    "Moshe",
    "Moisés",
    "Musa",
    "Mozes",
    "Moyse",
    "Mose",
    "Moss"
  ],
  "nicknames": [
    "Mo",
    "Mose",
    "Moshe",
    "Moss"
  ],
  "similarNames": [
    "Abraham",
    "Isaac",
    "Jacob",
    "Aaron",
    "Joshua",
    "Elijah",
    "Samuel",
    "David"
  ],
  "personality": "Names associated with Moses often convey wisdom, strong moral conviction, leadership qualities, courage, and a deep sense of justice and compassion.",
  "symbolism": "Symbolically, Moses represents liberation, divine law, faithful leadership, and the bridge between the human and divine realms.",
  "funFact": "Moses is one of the few biblical figures revered equally in Judaism, Christianity, and Islam, making it a truly universal name of faith.",
  "religiousSignificance": {
    "hasSignificance": true,
    "religions": [
      "Judaism",
      "Christianity",
      "Islam"
    ],
    "character": "Moses the Prophet and Lawgiver",
    "significance": "Moses led the Israelites out of Egyptian slavery in the Exodus, received the Ten Commandments and Torah from God on Mount Sinai, and guided the Hebrew people through 40 years in the wilderness toward the Promised Land.",
    "keyStories": [
      "Found in a basket on the Nile River as a baby",
      "The burning bush encounter where God revealed His name",
      "Confronting Pharaoh and the ten plagues of Egypt",
      "Parting the Red Sea to escape Egyptian armies",
      "Receiving the Ten Commandments on Mount Sinai",
      "Leading the Israelites for 40 years in the wilderness",
      "Viewing the Promised Land from Mount Nebo before his death"
    ],
    "spiritualMeaning": "The name embodies themes of divine calling, liberation from oppression, covenant with God, and faithful obedience despite challenges.",
    "historicalImpact": "Moses' legacy as lawgiver and liberator has profoundly influenced Western civilization, law, ethics, and religious thought for over 3,000 years."
  },
  "historicFigures": [
    {
      "fullName": "Moses Maimonides",
      "years": "1138-1204",
      "category": "Philosopher",
      "achievements": [
        "Wrote the Mishneh Torah, a comprehensive code of Jewish law",
        "Authored The Guide for the Perplexed, reconciling faith and reason",
        "Renowned physician and scholar",
        "Influenced both Jewish and Islamic philosophy",
        "Systematized Jewish legal tradition"
      ],
      "significance": "One of the most influential Jewish philosophers and scholars in history, Maimonides' works continue to shape religious and philosophical thought.",
      "notableWorks": [
        "Mishneh Torah",
        "Guide for the Perplexed"
      ]
    }
  ],
  "movies": [],
  "songs": [],
  "famousPeople": [],
  "famousAthletes": [],
  "famousQuotes": [],
  "characterQuotes": [],
  "syllables": {
    "count": 2,
    "breakdown": "Mo-ses"
  },
  "translations": [
    {
      "language": "Spanish",
      "name": "Moisés",
      "script": "Latin",
      "scriptName": "Moisés",
      "pronunciation": "/moiˈses/",
      "rtl": false
    },
    {
      "language": "Greek",
      "name": "Μωυσής",
      "script": "Greek",
      "scriptName": "Μωυσής",
      "pronunciation": "/moˈisis/",
      "rtl": false
    },
    {
      "language": "Arabic",
      "name": "موسى",
      "script": "Arabic",
      "scriptName": "موسى",
      "pronunciation": "/muːsa/",
      "rtl": true
    },
    {
      "language": "Chinese",
      "name": "摩西",
      "script": "Han",
      "scriptName": "摩西",
      "pronunciation": "/mó xī/",
      "rtl": false
    },
    {
      "language": "Russian",
      "name": "Моисей",
      "script": "Cyrillic",
      "scriptName": "Моисей",
      "pronunciation": "/mɐiˈsej/",
      "rtl": false
    },
    {
      "language": "Hebrew",
      "name": "משה",
      "script": "Hebrew",
      "scriptName": "משה",
      "pronunciation": "/moˈʃe/",
      "rtl": true
    }
  ],
  "categories": [
    {
      "tag": "Biblical",
      "confidence": 0.95,
      "reason": "Moses is a central figure in the Bible, known for leading the Israelites out of Egypt."
    },
    {
      "tag": "Classic",
      "confidence": 0.9,
      "reason": "The name has been used for centuries and is well-established in various cultures."
    },
    {
      "tag": "Timeless",
      "confidence": 0.9,
      "reason": "Moses remains a popular name across generations and cultures."
    },
    {
      "tag": "Modern",
      "confidence": 0.85,
      "reason": "Contains 2 modern indicators"
    },
    {
      "tag": "Strong",
      "confidence": 0.85,
      "reason": "The name is associated with leadership and strength in historical and religious contexts."
    }
  ],
  "enrichmentVersion": "v7",
  "v7EnhancedAt": "2025-10-24T17:23:49.605Z"
}